---
kind: method
id: M:Autodesk.Revit.DB.Electrical.PanelScheduleView.IsRowInCircuitTable(System.Int32)
source: html/33c23284-4971-05b8-54d0-ce0ffae93aec.htm
---
# Autodesk.Revit.DB.Electrical.PanelScheduleView.IsRowInCircuitTable Method

Check if this row in the circuit table

## Syntax (C#)
```csharp
public bool IsRowInCircuitTable(
	int nRow
)
```

## Parameters
- **nRow** (`System.Int32`) - Row Number

## Returns
True if this row in the circuit table, false otherwise.